Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException Constructor
 Initializes a new instance of the ConnectiveGeometryException class with general connective geometry error message.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometryException()
Public Sub New
See Also
Reference
ConnectiveGeometryException Class
ConnectiveGeometryException Overload
Tekla.Structures.Model Namespace